21-authentication/snack-tracker/app/views/retailers/show.html.erb

<ul>
<% @retailer.snacks.each do |s| %>
---
SELECT "snacks".* FROM "snacks" WHERE "snacks"."retailer_id" = ?  [["retailer_id", 4]]