23-authorization/snack-tracker/app/views/favorites/new.html.erb

<%= form_tag favorites_path do %>
    <% Snack.all.each do |s| %>
        <div>
            <%= check_box_tag "snack_ids[]", s.id, current_user.snacks.include?(s) %>
---
SELECT "snacks".* FROM "snacks"
SELECT  1 AS one FROM "snacks" INNER JOIN "favorites" ON "snacks"."id" = "favorites"."snack_id" WHERE "favorites"."user_id" = ? AND "snacks"."id" = ? LIMIT ?  [["user_id", 3], ["id", 18], ["LIMIT", 1]]