21-authentication/snack-tracker/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_user
        if @username
            return @username
        else
            user = User.find_by(id: session["user_id"])