20-cookies-and-sessions/snack-tracker/app/controllers/retailers_controller.rb

SELECT "retailers".* FROM "retailers"
---
  def index
    @retailers = Retailer.all

SELECT  "retailers".* FROM "retailers" WHERE "retailers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def show
    @retailer = Retailer.find(params[:id])

INSERT INTO "retailers" ("name", "year_established", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Yummy Candy"], ["year_established", 2019], ["created_at", "2019-02-04 16:14:17.344839"], ["updated_at", "2019-02-04 16:14:17.344839"]]
---
  def create
    @retailer = Retailer.new(retailer_params)
    if @retailer.save