23-authorization/snack-tracker/app/controllers/application_controller.rb

    def current_user
        if @user
            return @user
        else
            @user = User.find_by(id: session["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]