23-authorization/snack-tracker/app/controllers/favorites_controller.rb

    def create
        snack_ids = params[:snack_ids]
        snack_ids.each do |id|
            new_snack = Snack.find_by(id: id)
            if !current_user.snacks.include?(new_snack)
---
SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT  1 AS one FROM "snacks" INNER JOIN "favorites" ON "snacks"."id" = "favorites"."snack_id" WHERE "favorites"."user_id" = ? AND "snacks"."id" = ? LIMIT ?  [["user_id", 3], ["id", 21], ["LIMIT", 1]]