23-authorization/snack-tracker/app/controllers/snacks_controller.rb

  def index
    if current_user
      @snacks = current_user.snacks
    else
      @snacks = Snack.all
---
SELECT "snacks".* FROM "snacks" INNER JOIN "favorites" ON "snacks"."id" = "favorites"."snack_id" WHERE "favorites"."user_id" = ?  [["user_id", 3]]

  def create
    @snack = Snack.new(snack_params)
    if @snack.save
---
INSERT INTO "snacks" ("name", "calories", "deliciousness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Twinkies2"], ["calories", 200], ["deliciousness", 7], ["created_at", "2019-02-05 16:37:46.507940"], ["updated_at", "2019-02-05 16:37:46.507940"]]

  def update

    if @snack.update(snack_params)
---
UPDATE "snacks" SET "deliciousness" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["deliciousness", 2], ["updated_at", "2019-02-01 16:07:43.608513"], ["id", 4]]

  def destroy
    Snack.destroy(params[:id])
---
DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 6]]

  def get_snack
    @snack = Snack.find(params[:id])
---
SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]